app/controllers/reviews_controller.rb

	def create
		@review = Review.new(review_params)
		@review.wine_id = @wine.id
		@review.user_id = current_user.id

		if @review.save
---
INSERT INTO "reviews" ("rating", "comment", "wine_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", 4], ["comment", "1wsc"], ["wine_id", 1], ["user_id", 1], ["created_at", "2016-04-27 02:12:27.117704"], ["updated_at", "2016-04-27 02:12:27.117704"]]

	def update
		if @review.update(review_params)
---
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["rating", 3], ["updated_at", "2016-04-26 20:01:59.776830"], ["id", 12]]

		def find_wine
			@wine = Wine.find(params[:wine_id])
---
SELECT  "wines".* FROM "wines" WHERE "wines"."id" = ? LIMIT 1  [["id", 6]]