app/views/wines/show.html.erb

			<div class="average-review-rating" data-score=<%= @average_review %>></div>
			<span class="number-of-reviews">Based on <%= @wine.reviews.count %> reviews</span>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."wine_id" = ?  [["wine_id", 6]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."wine_id" = ?  [["wine_id", 2]]